[
    {
        "id": 0,
        "name": "Mismatch In Graphic Asset Declaration",
        "description": "Errors related to incorrect or missing graphic asset declarations in XML. This includes mismatches between declared and actual graphic file references, incorrect graphic formats, or missing graphic metadata."
    },
    {
        "id": 1,
        "name": "Missing Referred Id In Element",
        "description": "Errors where an element references an ID that does not exist in the document. This includes references to missing figures, tables, sections, or other elements that should have been defined but are not present."
    },
    {
        "id": 2,
        "name": "Incorrect Element Content Structure",
        "description": "Errors where the content structure of an element does not match the expected schema. This includes wrong child elements, incorrect ordering of elements, or elements appearing in unexpected contexts."
    },
    {
        "id": 3,
        "name": "Invalid Id Attribute Value",
        "description": "Errors related to ID attribute values that don't conform to XML naming rules or schema constraints. This includes IDs with invalid characters, incorrect format, or violating naming conventions."
    },
    {
        "id": 4,
        "name": "Invalid Para Or Character Style Present",
        "description": "Errors where paragraph or character styles are not declared in the DTD or schema. This includes custom font styles, text formatting styles, or style references that haven't been properly defined."
    },
    {
        "id": 5,
        "name": "Required Element Missing",
        "description": "Errors where mandatory elements according to the schema are not present. This includes incomplete element content where required child elements are missing or the element structure is incomplete."
    },
    {
        "id": 6,
        "name": "Duplicate Id Attribute",
        "description": "Errors where the same ID attribute value is used multiple times in the document. Each ID must be unique within the XML document scope."
    },
    {
        "id": 7,
        "name": "Undeclared Entity Present",
        "description": "Errors where entities are used in the document but have not been declared in the DTD or are not standard XML entities. This includes custom entity references without proper declaration."
    },
    {
        "id": 8,
        "name": "Attribute Id Is Missing",
        "description": "Errors where an element that requires an ID attribute does not have one. This is different from invalid ID values - here the ID attribute is completely absent when it should be present."
    },
    {
        "id": 9,
        "name": "Unclosed Element Tag",
        "description": "Errors related to XML elements that are not properly closed. This includes missing closing tags, mismatched opening and closing tags, or improperly nested elements."
    },
    {
        "id": 10,
        "name": "Invalid Attribute Format",
        "description": "Errors where attribute values do not conform to the expected format or data type. This includes incorrect date formats, invalid enumeration values, or attributes with values outside allowed ranges."
    }
]
